# Yolov5 + P2 + BiFPN

# Parameters
nc: 6  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple
anchors: 4            # AutoAnchor evolves 4 anchors per P output layer
  # - [10,13, 16,30, 33,23]  # P3/8
  # - [30,61, 62,45, 59,119]  # P4/16
  # - [116,90, 156,198, 373,326]  # P5/32

# replace activation function
    #activation: nn.Hardswish()         <-- final model 
    #activation: nn.Mish()
    #activation: nn.LeakyReLU(0.1)

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 6, 2, 2]],  # 0-P1/2
   [-1, 1, Conv, [128, 3, 2]],    # 1-P2/4
   [-1, 3, C3, [128]],
   [-1, 1, Conv, [256, 3, 2]],    # 3-P3/8
   [-1, 6, C3, [256]],
   [-1, 1, Conv, [512, 3, 2]],    # 5-P4/16
   [-1, 9, C3, [512]],
   [-1, 1, Conv, [1024, 3, 2]],   # 7-P5/32
   [-1, 3, C3, [1024]],
   [-1, 1, SE, [1024]],  # add SE
   [-1, 1, SPPF, [1024, 5]],      # 10
  ]

# YOLOv5 v6.0 P2 + BiFPN head
head:
  [[-1, 1, Conv, [512, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 6], 1, Concat, [1]],       # neck F4 -> concat backbone P4, P5 
   [-1, 3, C3, [512, False]],       # 14

   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 4], 1, Concat, [1]],       # neck F3 -> concat backbone P3, neck F4
   [-1, 3, C3, [256, False]],       # 18 (P3/8-small)

   [-1, 1, Conv, [128, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 2], 1, Concat, [1]],       # head D2 -> concat backbone P2, neck F3
   [-1, 3, C3, [128, False]],       # 22 (P2/4-xsmall)

   [-1, 1, Conv, [128, 3, 2]],
   [[-1, 19, 4], 1, Concat, [1]],   # head D3 -> concat head D2, neck F3, backbone P3 <--- BiFPN change
   [-1, 3, C3, [256, False]],       # 25 (P3/8-small)

   [-1, 1, Conv, [256, 3, 2]],
   [[-1, 15, 6], 1, Concat, [1]],   # head D4 -> concat head D3, neck F4, backbone P4 <--- BiFPN change
   [-1, 3, C3, [512, False]],       # 28 (P4/16-medium)

   [-1, 1, Conv, [512, 3, 2]],
   [[-1, 11], 1, Concat, [1]],      # head D5 -> concat head D4 + backbone P5
   [-1, 3, C3, [1024, False]],      # 31 (P5/32-large)

   [[22, 25, 28, 31], 1, Detect, [nc, anchors]],  # Detect(head D2, D3, D4, D5)
  ]
